[
    {
        "title": "Google Is a Monopolist in Online Advertising Tech, Judge Says",
        "link": "https://www.nytimes.com/2025/04/17/technology/google-ad-tech-antitrust-ruling.html",
        "summary": "The ruling was the second time in a year that a federal court had found that Google had acted illegally to maintain its dominance."
    },
    {
        "title": "What to Know About Trump’s Antitrust Efforts Against Google, Meta and Other Tech Giants",
        "link": "https://www.nytimes.com/2025/04/13/technology/trump-tech-antitrust-cases.html",
        "summary": "The Trump administration is continuing an aggressive effort to rein in the power of the biggest tech companies. Here’s what to know."
    },
    {
        "title": "IMF Warns Trump Tariffs Will Weaken Economy and Increase Inflation",
        "link": "https://www.nytimes.com/2025/04/17/business/economy/imf-trump-tariffs-global-economy.html",
        "summary": "Kristalina Georgieva, the managing director of the International Monetary Fund, warned in a speech that protectionism erodes productivity."
    },
    {
        "title": "European Central Bank Cuts Rates Amid Tariff Uncertainty",
        "link": "https://www.nytimes.com/2025/04/17/business/european-central-bank-rates-tariffs-trump.html",
        "summary": "Policymakers lowered rates a quarter point and said that the region’s growth outlook had “deteriorated” because of rising trade tensions."
    },
    {
        "title": "New Pushback to Trump’s Deportations, and Climate Research Under Threat",
        "link": "https://www.nytimes.com/2025/04/17/podcasts/the-headlines/trump-deportations-climate-research-capybara.html",
        "summary": "Plus, a capybara controversy in Argentina."
    },
    {
        "title": "I.R.S. Is Said to Be Considering Whether to Revoke Harvard’s Tax-Exempt Status",
        "link": "https://www.nytimes.com/2025/04/16/us/politics/trump-irs-harvard.html",
        "summary": "The move would be a major escalation of the Trump administration’s attempts to choke off federal money and support for the leading research university."
    },
    {
        "title": "Why Does Harvard Have Tax-Exempt Status and Can the IRS Revoke It? What to Know.",
        "link": "https://www.nytimes.com/2025/04/17/us/tax-exempt-status-irs-harvard.html",
        "summary": "The university, like many colleges and charities, is exempt from federal income and property taxes, saving it billions of dollars. President Trump has questioned whether it should enjoy that status."
    },
    {
        "title": "Trump’s Threats Force Powerful Institutions to Choose: Cut a Deal or Resist",
        "link": "https://www.nytimes.com/2025/04/16/us/politics/trump-universities-law-firms-deals.html",
        "summary": "In a hint of a shift in strategy, some of the country’s most powerful institutions have started choosing to resist."
    },
    {
        "title": "Texas Is Poised to Create a $1 Billion Private School Voucher Program",
        "link": "https://www.nytimes.com/2025/04/17/us/texas-trump-private-school-vouchers.html",
        "summary": "The Texas House approved the plan, part of a push by President Trump’s allies to offer up to about $10,000 for private school, home-school or virtual learning."
    },
    {
        "title": "The Fight Between Trump and Public Schools Over DEI Escalates",
        "link": "https://www.nytimes.com/2025/04/17/us/dei-public-schools-trump-administration-lawsuit.html",
        "summary": "Can President Trump withhold federal money for low-income students? A brewing fight over diversity, equity and inclusion programs may force the courts to decide."
    },
    {
        "title": "Trump Waved Off Planned Israeli Strike on Iranian Nuclear Sites",
        "link": "https://www.nytimes.com/2025/04/16/us/politics/trump-israel-iran-nuclear.html",
        "summary": "Israel developed plans for attacking Iranian nuclear facilities that would have required U.S. assistance. But some administration officials had doubts."
    },
    {
        "title": "Iran Says Despite Shifting U.S. Messages, It Plans to Keep Participating in Nuclear Talks",
        "link": "https://www.nytimes.com/2025/04/16/world/middleeast/iran-trump-nuclear-talks.html",
        "summary": "But Iran’s foreign minister said Tehran planned to participate “calmly and coolly” in the negotiations. Both sides will meet in Rome on Saturday for a second round, Iran’s Foreign Ministry said."
    },
    {
        "title": "White House Eyes Overhaul of Federal Housing Aid to the Poor",
        "link": "https://www.nytimes.com/2025/04/17/us/politics/housing-aid-hud-federal-budget.html",
        "summary": "The Trump administration has considered sharply curtailing vouchers as part of its budget for the 2026 fiscal year."
    },
    {
        "title": "Republican Lawmakers Face Fresh Backlash to Trump at Home",
        "link": "https://www.nytimes.com/2025/04/17/us/politics/republican-lawmakers-trump-backlash.html",
        "summary": "Despite some attempts to create controlled environments aimed at thwarting disruptions by protesters, congressional Republicans who are holding town halls are catching continued heat from their constituents."
    },
    {
        "title": "Boasberg Finds Probable Cause to Hold Trump Officials in Contempt Over Deportation Flights",
        "link": "https://www.nytimes.com/2025/04/16/us/politics/trump-probable-cause-contempt-deportation-flights.html",
        "summary": "The move was a remarkable attempt by a jurist to hold the White House accountable for its apparent willingness to flout court orders."
    },
    {
        "title": "He Wanted Peace in the Middle East. ICE Wants to Deport Him.",
        "link": "https://www.nytimes.com/2025/04/16/nyregion/columbia-activist-mahdawi-ice-palestinian.html",
        "summary": "Mohsen Mahdawi was arrested at a citizenship interview in Vermont. He had spent a decade trying to understand the conflict that shaped his life, his supporters say."
    },
    {
        "title": "Daily Pill May Work as Well as Ozempic for Weight Loss and Blood Sugar",
        "link": "https://www.nytimes.com/2025/04/17/health/pill-glp-1-eli-lilly.html",
        "summary": "Clinical results of a GLP-1 in pill form showed safety and efficacy data similar to blockbuster injectable drugs."
    },
    {
        "title": "Astronomers Detect a Signature of Life on a Distant Planet",
        "link": "https://www.nytimes.com/2025/04/16/science/astronomy-exoplanets-habitable-k218b.html",
        "summary": "Further studies are needed to determine whether K2-18b, which orbits a star 120 light-years away, is inhabited, or even habitable."
    },
    {
        "title": "What Mark Zuckerberg’s Washington, D.C., Mansion Says About His Ideological Shifts",
        "link": "https://www.nytimes.com/2025/04/17/realestate/mark-zuckerberg-washington-dc-mansion.html",
        "summary": "Mark Zuckerberg’s political ideology and tastes have evolved. His real estate portfolio reflects the shift."
    },
    {
        "title": "Hundreds of Capybaras ‘Conquered’ This Town. Now What?",
        "link": "https://www.nytimes.com/2025/04/17/world/americas/argentina-capybaras-vasectomies.html",
        "summary": "The world’s largest rodent is multiplying in — and dividing — one of Argentina’s most exclusive gated communities."
    },
    {
        "title": "The Emergency Is Here",
        "link": "https://www.nytimes.com/2025/04/17/opinion/ezra-klein-podcast-asha-rangappa.html",
        "summary": "Trump is disappearing people to a Salvadoran prison for terrorists. And he says he wants to send “homegrown” Americans there next."
    },
    {
        "title": "Trump Targets K-12",
        "link": "https://www.nytimes.com/2025/04/17/briefing/trump-targets-k-12.html",
        "summary": "We explain why the president is taking on public schools, and how officials are responding."
    },
    {
        "title": "Stephen Colbert Defends PBS and NPR Against Trump’s Defunding Plan",
        "link": "https://www.nytimes.com/2025/04/17/arts/television/stephen-colbert-pbs-npr-trump.html",
        "summary": "Colbert said both public media entities are “already operating on a shoestring budget — Daniel Tiger can’t even afford to wear pants.”"
    },
    {
        "title": "The Ukrainian Schoolmaster Teaching History to His Invaders",
        "link": "https://www.nytimes.com/2025/04/17/world/europe/ukraine-history-russian-falsehoods.html",
        "summary": "Vitalii Dribnytsia engages with Russians online to correct Kremlin propaganda about Ukraine. Over time, he has come to realize his more important audience is Ukrainians themselves."
    },
    {
        "title": "Israel Strikes Area With Tent Camps for Displaced Gazans",
        "link": "https://www.nytimes.com/2025/04/17/world/middleeast/israel-gaza-strike-mawasi.html",
        "summary": "The attack on the Mawasi area of southern Gaza killed at least a dozen people, according to the emergency rescue service in the territory. Israel did not confirm the location of the attack."
    },
    {
        "title": "U.K. Court Ruling on Trans Women Is Part of Wider Debate on Sex and Gender",
        "link": "https://www.nytimes.com/2025/04/17/world/europe/uk-trans-hungary-germany-us.html",
        "summary": "President Trump and right-wing politicians in Europe have railed against trans rights. Britain’s top court has now added its voice to the discussion."
    },
    {
        "title": "What Is Happening With Fyre Festival 2?",
        "link": "https://www.nytimes.com/2025/04/16/style/fyre-festival-2-location.html",
        "summary": "The organizers of Fyre Festival 2, a sequel to the ill-fated music event in 2017, said the festival would not longer take place in Playa del Carmen."
    }
]